package ch02.sec01;

public class Basic {

    /*
컴퓨터 메모리 = RAM ( Random Access Memory):
휘발성, 데이터를 저장,읽기,삭제 하는 공간
변수 = 하나의 값을 저장할 수 있는 메모리 번지에 붙여진 이름
하나
하나의 변수는 다양한 타입의 값을 저장할 수 업삳.
즉, 정수형 변수에는 정수값만 저장 가능! 정수형 변수로 선언 후 다른 형의 변수로 변경 불가능
    실수형 변수에는 실수값만 저장 가능. 중간에 저장할 수 있는 타입을 바꿀 수 없음.

    변수를 사용하려면 변수 선언해야한다.변수 선언할 때 저장할 값의 타입과 이름을 정한다.(변수명)
       같은 스코프 안에서는 이름의 변수 선언은 최초 한번만 가능
    int num;
    float num2; 실수값만 넣곘다

변수명 규칙
문자로 시작해야함)
0 예약 없이는 사용불가능
- 특수 기호중 _ $는 변수명으로 사용 가능 (문자열로 보기 때문에 ㅣ작문자로 사용가능
/- 대소문자를 가린다
- 카멜 스타일로 작성
- 의미가 있는 이름을 사용하는게 좋다. 최악 : a,b,c
- 너무 길지 않도록 desc : description, name:nm, class:cls
*/
    public static void main(String[] args) {
        int a;
        {int b;}
        {int b;}

        int _a;
        //int int; // 예약어 x
        int abc,aBc,abC; // 대소문자 가림
        int score = // 변수 선언
        score = 90; // 값 대입




        }

    }

